Revit 2024 API
ParameterUtils.DownloadParameterOptions Method
 Retrieves settings associated with the given parameter from the Parameters Service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ParameterDownloadOptions DownloadParameterOptions(
	ForgeTypeId parameterTypeId
)
Visual Basic
Public Shared Function DownloadParameterOptions ( _
	parameterTypeId As ForgeTypeId _
) As ParameterDownloadOptions
Visual C++
public:
static ParameterDownloadOptions^ DownloadParameterOptions(
	ForgeTypeId^ parameterTypeId
)
Parameters
parameterTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Parameter identifier.
Return Value
 Settings associated with a parameter.
Remarks
 The settings associated with a parameter definition are accessible only to an authorized user. To retrieve them, the user must be signed in.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.AccessDeniedException |  Thrown when the user is not authorized to access the requested information.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the given parameter identifier is empty.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
[!:Autodesk::Revit::Exceptions::NetworkCommunicationError] |  Thrown when communication with the Parameters Service is unsuccessful.
Autodesk.Revit.Exceptions.ResourceNotFoundException |  Thrown when the requested parameter is not found.
Autodesk.Revit.Exceptions.ServerInternalException |  Thrown when the Parameters Service reports an internal error.
Autodesk.Revit.Exceptions.UnauthenticatedException |  Thrown when the user is not signed in.
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace